app/controllers/patients_controller.rb

  def index
    @patients = Patient.order(sort_column + " " + sort_direction).paginate(:page => params[:page], :per_page => 10)
---
SELECT  `patients`.* FROM `patients`  ORDER BY created_at asc LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `patients`

  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save
---
INSERT INTO `patients` (`name`, `address`, `age`, `phone_no`, `created_at`, `updated_at`) VALUES ('sample1', 'hyd', 3, 4, '2015-08-30 06:30:29', '2015-08-30 06:30:29')

  def update
    respond_to do |format|
      if @patient.update(patient_params)
---
UPDATE `patients` SET `address` = 'erode', `updated_at` = '2015-09-06 15:03:11' WHERE `patients`.`id` = 2

  def reading
    @clucose_reading = Patient.find_by(:id=>params[:id].to_i)
---
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 1 LIMIT 1

  def create_glucose_reading

     @clucose_reading = GlucoseReading.new(:patient_id => params[:patient][:id].to_i,:reading=>params[:glucose][:reading].to_i)

    respond_to do |format|
      if @clucose_reading.save
---
INSERT INTO `glucose_readings` (`patient_id`, `reading`, `created_at`, `updated_at`) VALUES (1, 12, '2015-08-30 13:48:28', '2015-08-30 13:48:28')

def monthly_report
  @reports = GlucoseReading.where("date(created_at) >= ? and date(created_at) <=?",Date.today,Date.today)
---
SELECT `glucose_readings`.* FROM `glucose_readings` WHERE (date(created_at) >= '2015-09-06' and date(created_at) <='2015-09-06')

def show_month_wise

  @month_report = GlucoseReading.where("date(created_at) >= ? and date(created_at) <=?",params[:start][:date].to_date.strftime("%Y-%m-%d"),params[:end][:date].to_date.strftime("%Y-%m-%d"))
---
SELECT `glucose_readings`.* FROM `glucose_readings` WHERE (date(created_at) >= '2015-08-08' and date(created_at) <='2015-09-22')  ORDER BY created_at asc

  def month_wise_report
    @reports = GlucoseReading.where("MONTH(created_at) = ? and YEAR(created_at) = ? ",Date.today.month,Date.today.year)
---
SELECT `glucose_readings`.* FROM `glucose_readings` WHERE (MONTH(created_at) = 9 and YEAR(created_at) = 2015 )

  def find_month_wise_report

    @reports = GlucoseReading.where("MONTH(created_at) = ? and YEAR(created_at) = ? ",params[:timer][:month],params[:timer][:year])
---
SELECT `glucose_readings`.* FROM `glucose_readings` WHERE (MONTH(created_at) >= '9' and MONTH(created_at) <= '2015' )

    def set_patient
      @patient = Patient.find(params[:id])
---
SELECT `patients`.* FROM `patients` WHERE (date(created_at) >= '09-22-2015' and date(created_at) <='09-14-2015')